app/views/comments/_comments.html.erb

INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Sugar Bear"], ["body", "brought too much honey to the party."], ["post_id", 6], ["created_at", "2017-10-29 12:36:38.088154"], ["updated_at", "2017-10-29 12:36:38.088154"]]
---
  <% @comments.each do |comment| %>
    <li><%= comment.content %> created: <%= comment.created_at %></li>