app/views/comments/_comment.html.erb

<li><%= comment.content %> created: <%= comment.created_at %></li>
---
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sandwich"], ["post_id", 1], ["created_at", "2017-10-30 01:26:38.831616"], ["updated_at", "2017-10-30 01:26:38.831616"]]