app/views/comments/show_comment.html.erb

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "wawefawefawef"], ["post_id", 5], ["created_at", "2017-10-29 21:27:38.640437"], ["updated_at", "2017-10-29 21:27:38.640437"]]
---
<li><%= @comment.content %> created: <%= @comment.created_at %></li>