app/controllers/comments_controller.rb

  def edit
    @comment = Comment.find(params[:post_id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 3], ["id", 7], ["LIMIT", 1]]

  def create
    @comment = @post.comments.create(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Bobby"], ["body", "Good call."], ["post_id", 1], ["created_at", "2017-10-26 02:51:08.258611"], ["updated_at", "2017-10-26 02:51:08.258611"]]